
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_api_management_subscription.et_acas_subscription
* Replace
  * module.et-acas-mgmt-api.azurerm_api_management_api.api


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.et_acas_subscription will be updated in-place
  ~ resource "azurerm_api_management_subscription" "et_acas_subscription" {
      ~ allow_tracing       = false -> true
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/subscriptions/6d3fecbd-0e37-48b9-bbda-c2c4664b3871"
        # (10 unchanged attributes hidden)
    }

  # module.et-acas-mgmt-api.azurerm_api_management_api.api must be replaced
-/+ resource "azurerm_api_management_api" "api" {
      ~ id                    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-prod/apis/et-acas-api;rev=1-1" -> (known after apply)
      ~ is_current            = true -> (known after apply)
      ~ is_online             = false -> (known after apply)
        name                  = "et-acas-api"
      ~ revision              = "1-1" -> "1-2" # forces replacement
      + version               = (known after apply)
      + version_set_id        = (known after apply)
        # (12 unchanged attributes hidden)

      ~ import {
          ~ content_value  = "https://raw.githubusercontent.com/hmcts/reform-api-docs/master/docs/specs/et-acas-api.json" -> "https://raw.githubusercontent.com/hmcts/reform-api-docs/master/docs/specs/et-acas-api-prod.json"
            # (1 unchanged attribute hidden)
        }

      ~ subscription_key_parameter_names (known after apply)
      - subscription_key_parameter_names {
          - header = "Ocp-Apim-Subscription-Key" -> null
          - query  = "subscription-key" -> null
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1225,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->